In [ ]:
# To join DataFrames, pandas provides multiple functions like concat() , merge() , join() , etc.

In [1]:
import pandas as pd

# pd.concat

In [ ]:
# Concatenate pandas objects along a particular axis with optional set logic along the other axes.
# Can also add a layer of hierarchical indexing on the concatenation axis, 
# which may be useful if the labels are the same (or overlapping) on the passed axis number.

In [2]:
d={'a':[1,2],'b':[3,4],'c':[5,6]}

In [3]:
d

{'a': [1, 2], 'b': [3, 4], 'c': [5, 6]}

In [4]:
df=pd.DataFrame(d)

In [27]:
df

   a  b  c
0  1  3  5
1  2  4  6

In [5]:
d1={'x':[7,8],'y':[8,9],'z':[9,0]}

In [6]:
df1=pd.DataFrame(d1)

In [7]:
df1

   x  y  z
0  7  8  9
1  8  9  0

In [8]:
pd.concat([df,df1],axis=1)

   a  b  c  x  y  z
0  1  3  5  7  8  9
1  2  4  6  8  9  0

# JOIN
# df.join
When we have different columns always first go with join command (Golden Rule)

In [ ]:
# Join columns of another DataFrame.
# Join columns with other DataFrame either on index or on a key column.
# Efficiently join multiple DataFrame objects by index at once by passing a list.

In [9]:
d2={'A':[1,2],'B':[3,4],'C':[5,6],'D':[7,8]}

In [10]:
leftdf=pd.DataFrame(d2,index=['Y','Z'])

In [11]:
leftdf

   A  B  C  D
Y  1  3  5  7
Z  2  4  6  8

In [12]:
d3={'E':[8,9],'F':[9,10],'G':[10,11],'H':[11,12]}

In [13]:
rightdf=pd.DataFrame(d3,index=['Z','Q'])

In [14]:
rightdf

   E   F   G   H
Z  8   9  10  11
Q  9  10  11  12

In [ ]:
# Outer join pandas: Returns all rows from both tables, join records from the left which have matching keys in the right table.

In [15]:
leftdf.join(rightdf,how='outer')

     A    B    C    D    E     F     G     H
Q  NaN  NaN  NaN  NaN  9.0  10.0  11.0  12.0
Y  1.0  3.0  5.0  7.0  NaN   NaN   NaN   NaN
Z  2.0  4.0  6.0  8.0  8.0   9.0  10.0  11.0

In [ ]:
# An inner join combines two DataFrames based on a join key and returns a new DataFrame that contains only those rows that have matching values in both of the original DataFrames.

In [16]:
leftdf.join(rightdf,how='inner')

   A  B  C  D  E  F   G   H
Z  2  4  6  8  8  9  10  11

In [17]:
leftdf.join(rightdf,how='right')

     A    B    C    D  E   F   G   H
Z  2.0  4.0  6.0  8.0  8   9  10  11
Q  NaN  NaN  NaN  NaN  9  10  11  12

In [18]:
leftdf.join(rightdf,how='left')

   A  B  C  D    E    F     G     H
Y  1  3  5  7  NaN  NaN   NaN   NaN
Z  2  4  6  8  8.0  9.0  10.0  11.0